In [51]:
"""Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series."""
import pandas as pd

In [52]:
data=4,5,15,16,23,42
s=pd.Series(data)

In [53]:
print("Series:\n",s)

Series:
 0     4
1     5
2    15
3    16
4    23
5    42
dtype: int64

In [54]:
"""Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it."""
import pandas as pd

In [55]:
list=[1,2,3,4,5,6,7,8,9,10]
s=pd.Series(list)

In [56]:
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [57]:
"""Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female"""
import pandas as pd

In [58]:
data= {'Name':['Alice','Bob','Claire'], "Age":[25,30,27],'Gender':['Female','Male','Female']
       }

In [59]:
data

{'Name': ['Alice', 'Bob', 'Claire'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [60]:
df=pd.DataFrame(data)

In [61]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [62]:
"""Q4. What is 'DataFrame'in pandas and how is it different from pandas.series? Explain with an example."""
import pandas as pd

In [63]:
"""DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.
Series is a 1-dimensional data structure used to represent a single column or row of data within a DataFrame or as a Data structure"""
list=[1,2,3,4,5,6,7,8,9,10]

In [64]:
list

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [65]:
df=pd.DataFrame(list)
s=pd.Series(list)

In [66]:
df

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [67]:
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [68]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?"""
import pandas as pd

In [69]:
data = {'Name': ['A','B','C','D','E'],'Id':[101,102,103,104,105],'Marks':[450,600,125,594,265],'Grade':['pass','distinction','fail','pass','fail']}

In [70]:
df=pd.DataFrame(data)

In [71]:
df

  Name   Id  Marks        Grade
0    A  101    450         pass
1    B  102    600  distinction
2    C  103    125         fail
3    D  104    594         pass
4    E  105    265         fail

In [72]:
df.columns

Index(['Name', 'Id', 'Marks', 'Grade'], dtype='object')

In [73]:
df.head(3)

  Name   Id  Marks        Grade
0    A  101    450         pass
1    B  102    600  distinction
2    C  103    125         fail

In [74]:
df.tail(3)

  Name   Id  Marks Grade
2    C  103    125  fail
3    D  104    594  pass
4    E  105    265  fail

In [75]:
df.shape

(5, 4)

In [76]:
df.describe

<bound method NDFrame.describe of   Name   Id  Marks        Grade
0    A  101    450         pass
1    B  102    600  distinction
2    C  103    125         fail
3    D  104    594         pass
4    E  105    265         fail>

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
Series: Serires is a 1-d structured data. It is a collumn in a table. Series is mutable. we can modify the data in series, we can add,remove the data.

DataFrame: DataFrame is a 2-dimensional structured data. DataFrame is mutable. DataFrame is the collection of rows and columns.In DataFrame we can also modify the data.

Panel: Panel is a 3-dimensional structured data. In this 3 axes are intended to give the describing operations involving panel data, econometric analysis of panel data.Panel is mutable

In [77]:
"""Q7. Create a DataFrame using multiple Series. Explain with an example."""
import pandas as pd

In [78]:
data = {'Name': ['A','B','C','D','E'],'Id':[101,102,103,104,105],'Marks':[450,600,125,594,265],'Grade':['pass','distinction','fail','pass','fail']}

In [79]:
data

{'Name': ['A', 'B', 'C', 'D', 'E'],
 'Id': [101, 102, 103, 104, 105],
 'Marks': [450, 600, 125, 594, 265],
 'Grade': ['pass', 'distinction', 'fail', 'pass', 'fail']}

In [80]:
Name=pd.Series(['A','B','C','D','E'])
Id=pd.Series([101,102,103,104,105])
Marks=pd.Series([450,600,125,594,265])
Grade=pd.Series(['pass','distinction','fail','pass','fail'])

In [81]:
df=pd.DataFrame(data)

In [82]:
df

  Name   Id  Marks        Grade
0    A  101    450         pass
1    B  102    600  distinction
2    C  103    125         fail
3    D  104    594         pass
4    E  105    265         fail